FI/Paikkatilanne/Integraatiopalvelu_Osaston potilasliikenne_Palvelukuvaus_1.0.xml

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="PatientTransfersService" targetNamespace="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="urn:Tieto.HCW.EIS.PaikkatilanneService.ServiceContracts" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="urn:Tieto.HCW.EIS.PaikkatilanneService.ServiceContracts"><xs:import namespace="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/><xs:element name="PatientTransfersRequest"><xs:complexType><xs:sequence><xs:element minOccurs="0" ref="q1:MessageHeader" xmlns:q1="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/><xs:element minOccurs="0" ref="q2:Common" xmlns:q2="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/><xs:element minOccurs="0" ref="q3:Transfers" xmlns:q3="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetPatientTransfersDataResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" ref="q4:AcknowledgeRequestStatus" xmlns:q4="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/><xs:element minOccurs="0" ref="q5:MessageHeader" xmlns:q5="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/><xs:element minOccurs="0" ref="q6:PatientTransfers" xmlns:q6="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"><xs:complexType name="MessageHeader"><xs:sequence><xs:element minOccurs="0" name="CharacterSet" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DataServiceURL" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="MessageID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ReceiverApplication" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ReceiverID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SenderApplication" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SenderID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="TransactionID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserLanguageCode" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="VersionNumber" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="MessageHeader" nillable="true" type="tns:MessageHeader"/><xs:complexType name="Common"><xs:sequence><xs:element minOccurs="0" name="ContractKey" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserId" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CallingSystem" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CallingUserId" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Common" nillable="true" type="tns:Common"/><xs:complexType name="AcknowledgeRequestStatus"><xs:sequence><xs:element minOccurs="0" name="ErrorMessage" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ErrorType" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="HasOperationFailed" type="xs:boolean"/></xs:sequence></xs:complexType><xs:element name="AcknowledgeRequestStatus" nillable="true" type="tns:AcknowledgeRequestStatus"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts"/><xs:element name="MessageHeader" nillable="true" type="q1:MessageHeader" xmlns:q1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element name="Common" nillable="true" type="q2:Common" xmlns:q2="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element name="Transfers" nillable="true" type="q3:PatientTransfersReq" xmlns:q3="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts"/><xs:element name="AcknowledgeRequestStatus" nillable="true" type="q4:AcknowledgeRequestStatus" xmlns:q4="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element name="PatientTransfers" nillable="true" type="q5:PatientTransfers" xmlns:q5="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PaikkatilanneService.DataContracts"><xs:complexType name="PatientTransfersReq"><xs:sequence><xs:element minOccurs="0" name="Timestamp" type="xs:dateTime"/><xs:element name="Hospital" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="PatientTransfersReq" nillable="true" type="tns:PatientTransfersReq"/><xs:complexType name="PatientTransfers"><xs:sequence><xs:element minOccurs="0" name="Registrations" nillable="true" type="tns:ArrayOfRegistration"/><xs:element minOccurs="0" name="Timestamp" type="xs:dateTime"/></xs:sequence></xs:complexType><xs:element name="PatientTransfers" nillable="true" type="tns:PatientTransfers"/><xs:complexType name="ArrayOfRegistration"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Registration" nillable="true" type="tns:Registration"/></xs:sequence></xs:complexType><xs:element name="ArrayOfRegistration" nillable="true" type="tns:ArrayOfRegistration"/><xs:complexType name="Registration"><xs:sequence><xs:element minOccurs="0" name="Type" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="PatientInfo" nillable="true" type="tns:PatientInfo"/><xs:element minOccurs="0" name="SendingUnit" nillable="true" type="tns:SendingUnit"/><xs:element minOccurs="0" name="ReceivingUnit" nillable="true" type="tns:ReceivingUnit"/><xs:element minOccurs="0" name="TransferTime" nillable="true" type="xs:dateTime"/></xs:sequence></xs:complexType><xs:element name="Registration" nillable="true" type="tns:Registration"/><xs:complexType name="PatientInfo"><xs:complexContent mixed="false"><xs:extension base="tns:PatientData"><xs:sequence><xs:element minOccurs="0" name="Diagnoses" nillable="true" type="tns:ArrayOfDiagnose"/></xs:sequence></xs:extension></xs:complexContent></xs:complexType><xs:element name="PatientInfo" nillable="true" type="tns:PatientInfo"/><xs:complexType name="PatientData"><xs:sequence><xs:element name="SSN" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="FamilyName" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="GivenNames" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="PatientData" nillable="true" type="tns:PatientData"/><xs:complexType name="ArrayOfDiagnose"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="Diagnose" nillable="true" type="tns:Diagnose"/></xs:sequence></xs:complexType><xs:element name="ArrayOfDiagnose" nillable="true" type="tns:ArrayOfDiagnose"/><xs:complexType name="Diagnose"><xs:sequence><xs:element minOccurs="0" name="Code1" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="AST" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Code2" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Explanation" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Type" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Diagnose" nillable="true" type="tns:Diagnose"/><xs:complexType name="SendingUnit"><xs:complexContent mixed="false"><xs:extension base="tns:Unit"><xs:sequence/></xs:extension></xs:complexContent></xs:complexType><xs:element name="SendingUnit" nillable="true" type="tns:SendingUnit"/><xs:complexType name="Unit"><xs:sequence><xs:element minOccurs="0" name="Organization" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Ward" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="WardName" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="Unit" nillable="true" type="tns:Unit"/><xs:complexType name="ReceivingUnit"><xs:complexContent mixed="false"><xs:extension base="tns:Unit"><xs:sequence/></xs:extension></xs:complexContent></xs:complexType><xs:element name="ReceivingUnit" nillable="true" type="tns:ReceivingUnit"/></xs:schema></wsdl:types><wsdl:message name="PatientTransfersRequest"><wsdl:part name="parameters" element="q1:PatientTransfersRequest" xmlns:q1="urn:Tieto.HCW.EIS.PaikkatilanneService.ServiceContracts"/></wsdl:message><wsdl:message name="GetPatientTransfersResponse"><wsdl:part name="parameters" element="q2:GetPatientTransfersDataResponse" xmlns:q2="urn:Tieto.HCW.EIS.PaikkatilanneService.ServiceContracts"/></wsdl:message><wsdl:portType name="IPatientTransfersService"><wsdl:operation name="GetPatientTransfers"><wsdl:input wsaw:Action="urn:Tieto.HCW.Tieto.HCW.EIS.PaikkatilanneService.WCFService.GetPatientTransfers" name="PatientTransfersRequest" message="tns:PatientTransfersRequest"/><wsdl:output wsaw:Action="urn:Tieto.HCW.EIS.PaikkatilanneService.WCFService/IPatientTransfersService/GetPatientTransfersResponse" name="GetPatientTransfersResponse" message="tns:GetPatientTransfersResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IPatientTransfersService" type="tns:IPatientTransfersService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetPatientTransfers"><soap:operation soapAction="urn:Tieto.HCW.Tieto.HCW.EIS.PaikkatilanneService.WCFService.GetPatientTransfers" style="document"/><wsdl:input name="PatientTransfersRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="GetPatientTransfersResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="PatientTransfersService"><wsdl:port name="BasicHttpBinding_IPatientTransfersService" binding="tns:BasicHttpBinding_IPatientTransfersService"><soap:address location="http://localhost:49795/PatientTransfersService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>